/* Tool tip for the continue execution button */
"continueButtonToolTip" = "Продолжить выполнение";

/* Tool tip for the step into instruction button */
"stepIntoSegmentToolTip" = "Выполнить шаг, заходя в иструкции";

/* Tool tip for the step over instruction button */
"stepOverSegmentToolTip" = "Выполнить шаг, не заходя в инструкции";

/* Tool tip for the step out of function button */
"stepOutSegmentToolTip" = "Выйти из текущей функции";

/* Labels 'Go to Call Address' menu item in Debug menu when using debugger, when a 'call' type instruction is selected */
"goToCallAddress" = "Перейти к адресу";

/* Labels 'Go to Branch Address' menu item in Debug menu when using debugger, when a 'jmp' type instruction is selected */
"goToBranchAddress" = "Перейти к ветке адреса";

/* Labels 'Add Breakpoint' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it; also used for undo'ing an add breakpoint change in Edit menu */
"addBreakpoint" = "Добавить Брикпоинт";

/* Labels 'Add Breakpoints' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it; also used for undo'ing an add breakpoints change in Edit menu */
"addBreakpoints" = "Добавить несколько Брикпоинтов";

/* Labels 'Add Hardware Breakpoint' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it */
"addHardwareBreakpoint" = "Add Hardware Breakpoint";

/* Labels 'Add Hardware Breakpoints' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it */
"addHardwareBreakpoints" = "Add Hardware Breakpoints";

/* Labels 'Remove Breakpoint' menu item in Debug menu when using debugger, when selected instruction does have a breakpoint attached to it; also used for undo'ing an remove breakpoint change in Edit menu */
"removeBreakpoint" = "Убрать Брикпоинт";

/* Labels 'Remove Breakpoints' menu item in Debug menu when using debugger, when selected instruction does have a breakpoint attached to it; also used for undo'ing an remove breakpoints change in Edit menu */
"removeBreakpoints" = "Убрать несколько Брикпоинтов";

/* Labels 'NOP Instruction' menu item in Debug menu when using debugger */
"nopInstruction" = "NOP-инструкция";

/* Labels 'NOP Instructions' menu item in Debug menu when using debugger */
"nopInstructions" = "NOP-иструкции";

/* Tooltip Label when mouse hovering over an instruction that has a breakpoint condition configured */
"breakpointConditionTooltipLabel" = "Брикпоинт-условия";

/* Tooltip Label for letting user know debugging intel code in Rosetta process is unsupported when mouse hovering over an instruction breakpoint column */
"breakpointIntelRosettaUnsupportedTooltipLabel" = "Отладка кода Intel в целях Rosetta не поддерживается. Однако поддерживается отладка кода ARM.";

/* Alert title that shows up when failing to alter an instruction's assembly */
"failedModifyInstructionAlertTitle" = "Не удалось изменить Инструкцию";

/* Alert message that shows up when failing to alter an instruction's assembly */
"failedModifyInstructionAlertMessage" = "Произошла ошибка при сборке";

/* Alert title that shows up when failing to overwrite an instruction */
"failedOverwriteInstructionsAlertTitle" = "Неудалось перезаписать Инструкции";

/* Alert message that shows up when failing to overwrite an instruction */
"failedOverwriteInstructionsAlertMessage" = "Это изменение выходит за границы отображенных инструкций.";

/* Alert title that shows up when changing an instruction may require altering more than one instruction */
"overwriteConfirmationAlertTitle" = "Перезаписывание Инструкции";

/* Alert message that shows up when changing an instruction may require altering more than one instruction */
"overwriteConfirmationAlertMessageFormat" = "Это изменеие перезапишет %ld инструкции. Вы уверены, что хотите перезаписать их?";

/* Alert button that shows up when changing an instruction may require altering more than one instruction */
"overwrite" = "Перезапись";

/* Undo action for changing an instruction */
"undoInstructionChange" = "Изменение Инструкций";

/* Undo action for nopping an instruction */
"undoNOPChange" = "NOP-изменение";

/* Alert title that shows up when adding a breakpoint fails */
"failedAddBreakpointAlertTitle" = "Не удалось установить брикпоинт";

/* Alert message that shows up when adding a breakpoint fails */
"failedAddBreakpointAlertMessage" = "Невозможно установить брикпоинт.";

/* Undo action for moving the instruction pointer */
"undoMoveInstructionPointer" = "Перейти";

/* Notification title for when a breakpoint is hit */
"hitBreakpointNotificationTitle" = "Задет Брикпоинт";

/* Notification message for when a breakpoint is hit */
"hitBreakpointNotificationMessage" = "Остановлено на брикпоинте";

/* Alert title for failing to change a breakpoint condition */
"failedChangeBreakpointConditionAlertTitle" = "Неверное выражение для Брикпоинта";

/* Alert message format for failing to change a breakpoint condition */
"failedChangeBreakpointConditionAlertMessageFormat" = "Ошибка при попытке разобрать выражение '%@'";

/* Alert title for when a breakpoint condition fails to execute */
"failedExecuteBreakpointConditionAlertTitle" = "Ошибка анализа условия";

/* Alert message for when a breakpoint condition fails to execute */
"failedExecuteBreakpointConditionAlertMessage" = "\"%@\" не удалось проанализировать по следующим причинам: %@. Смотрите записи Журнала через меню Отладка";

/* Alert title for failing to step over an instruction */
"failedStepOverAlertTitle" = "Не удалось перешагнуть";

/* Alert message for failing to step over an instruction */
"failedStepOverAlertMessage" = "Неудалось перешагнуть через инструкцию.";

/* Alert title for failing to step out */
"failedStepOutAlertTitle" = "Не удалось выйти";

/* Alert message for failing to step out */
"failedStepOutAlertMessage" = "не удалось выйти из процедуры.";

/* Error indicating keystone engine could not be started (unlikely to occur) */
"failedAssembleWithStartingEngine" = "assembly engine не удалось запустить с ошибкой %u";

/* Error indicating keystone engine could not assemble code */
"failedAssembleCode" = "не удалось сгенерировать код с ошибкой %u.";

/* Error indicating current instructions could not be NOP'ed for code injection */
"failedNOPInstructionsForInjectingCode" = "невозможно добавить NOP для этих инструкций";

/* Error indicating code injection for rosetta is not supported */
"failedInjectCodeForRosetta" = "внедрение кода не поддерживается для целей Rosetta";

/* Alert Title for failing to allocate memory for code injection */
"failedAllocateMemoryForInjectingCodeAlertTitle" = "Не удалось выделить память";

/* Alert Message for failing to allocate memory for code injection */
"failedAllocateMemoryForInjectingCodeAlertMessage" = "Произошла ошибка, пытаясь выделить новую память для мишени";

/* Alert Title for failing to inject code at the destination. Used in two places in code. */
"failedInjectCodeAlertTitle" = "Не удалось внедрить код";

/* Alert Message for failing to inject code at the destination */
"failedInjectCodeAlertMessage" = "Не было достаточно места, чтобы перезаписать эту инструкцию, или вновь распределённый адрес был слишком далеко";

/* Message indicating where the new code will be inserted into */
"newlyCodeInjectedAtMessage" = "; Новый код будет записан в 0x%llX\n";

/* Message for assembling code failing when attemping to inject code. */
"failedAssemblingForInjectingCodeMessage" = "Ошибка ассемблирования нового кода";

/* Error indicating memory protection could not be changed for newly injected instructions */
"failedChangeMemoryProtectionForInjectingCode" = "Не удалось изменить защиту памяти для новых инструкций";
